In [382]:
import pandas as pd
import numpy as np

In [383]:
df = pd.read_csv('data.csv')
data = pd.read_csv('/home/developer/Desktop/data.csv', index_col=0)
data

              Name   Age   Salary       DoB
Sno.
1     Ashish Yadav  22.0  15000.0  26/04/02
2             Anil  23.0  10000.0  20/02/02
3            Aswan  21.0  20000.0  27/05/02
4          Harshit   NaN  15000.0       NaN
5          Sandeep  25.0      NaN  09/02/96
6             Ajay  26.0      NaN  28/02/98
7          Bhawesh  23.0  20000.0    110811
8              NaN  30.0  80000.0  19981205

# Data Cleaning

In [384]:
df['Date'] = pd.to_datetime(df['Date'], format='mixed')
df.dropna(subset='Date', inplace=True)
x = df['Calories'].mean()
df['Calories'].fillna(x, inplace=True)
df.loc[7, 'Duration'] = 45
for x in df.index:
    if df.loc[x, 'Maxpulse'] > 150:
        df.loc[x, 'Maxpulse'] = 150
    if df.loc[x, 'Pulse'] < 95:
        df.loc[x, 'Pulse'] = 95

# Reshapnig
pandas provides methods for manipulating a Series and DataFrame to alter the representation of the data for further data processing or data summarization.

# stack() and unstack():
 Pivot a column or row level to the opposite axis respectively.

In [385]:
stacked = data.stack()
print(stacked.unstack(0))
print(stacked.unstack())

Sno.               1         2         3        4         5         6  \
Name    Ashish Yadav      Anil     Aswan  Harshit   Sandeep      Ajay
Age             22.0      23.0      21.0      NaN      25.0      26.0
Salary       15000.0   10000.0   20000.0  15000.0       NaN       NaN
DoB         26/04/02  20/02/02  27/05/02      NaN  09/02/96  28/02/98

Sno.          7         8
Name    Bhawesh       NaN
Age        23.0      30.0
Salary  20000.0   80000.0
DoB      110811  19981205
              Name   Age   Salary       DoB
Sno.
1     Ashish Yadav  22.0  15000.0  26/04/02
2             Anil  23.0  10000.0  20/02/02
3            Aswan  21.0  20000.0  27/05/02
4          Harshit   NaN  15000.0       NaN
5          Sandeep  25.0      NaN  09/02/96
6             Ajay  26.0      NaN  28/02/98
7          Bhawesh  23.0  20000.0    110811
8              NaN  30.0  80000.0  19981205

Pivot Tables :- pivot() and pivot_table(): Group unique values within one or more discrete categories.
pivot() can only handle unique rows specified by index and columns. If you data contains duplicates, use pivot_table().

# pivot()
Data is often stored in so-called “stacked” or “record” format. In a “record” or “wide” format, typically there is one row for each subject. In the “stacked” or “long” format there are multiple rows for each subject where applicable.

In [386]:
data1 = {
   "value": range(12),
   "variable": ["A"] * 3 + ["B"] * 3 + ["C"] * 3 + ["D"] * 3,
   "date": pd.to_datetime(["2020-01-03", "2020-01-04", "2020-01-05"] * 4)
}
df1 = pd.DataFrame(data1)
df1.pivot(index='date', columns='variable', values='value')

variable    A  B  C   D
date
2020-01-03  0  3  6   9
2020-01-04  1  4  7  10
2020-01-05  2  5  8  11

In [387]:
df1['value2'] = df1['value'] * 2
df1.pivot(index='date', columns='variable')

           value           value2
variable       A  B  C   D      A   B   C   D
date
2020-01-03     0  3  6   9      0   6  12  18
2020-01-04     1  4  7  10      2   8  14  20
2020-01-05     2  5  8  11      4  10  16  22

# pivot_table()
While pivot() provides general purpose pivoting with various data types, pandas also provides pivot_table() or pivot_table() for pivoting with aggregation of numeric data.

In [388]:
pd.pivot_table(df1, index='date', columns='variable', values='value2', aggfunc=['sum', 'mean'], margins=True)

                    sum                  mean
variable              A   B   C   D  All    A   B   C   D   All
date
2020-01-03 00:00:00   0   6  12  18   36    0   6  12  18   9.0
2020-01-04 00:00:00   2   8  14  20   44    2   8  14  20  11.0
2020-01-05 00:00:00   4  10  16  22   52    4  10  16  22  13.0
All                   6  24  42  60  132    2   8  14  20  11.0

In [389]:
rng = pd.date_range("1/1/2012", periods=100, freq="s")

ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)

ts.resample("5Min").sum()

2012-01-01    25237
Freq: 5T, dtype: int64

In [390]:
df2 = pd.DataFrame(
    {"id": [1, 2, 3, 4, 5, 6], "raw_grade": ["a", "b", "b", "c", "a", "e"]}
)
df2['grade'] = df2['raw_grade'].astype('category')
print(df2['grade'])
new_categories = ["very good", "good", 'bad', "very bad"]
df2['grade'] = df2['grade'].cat.rename_categories(new_categories)
df2
df2["grade"] = df2['grade'].cat.set_categories(['very bad', 'bad', 'medium', 'good', 'very good'])
df2['grade']

0    a
1    b
2    b
3    c
4    a
5    e
Name: grade, dtype: category
Categories (4, object): ['a', 'b', 'c', 'e']

0    very good
1         good
2         good
3          bad
4    very good
5     very bad
Name: grade, dtype: category
Categories (5, object): ['very bad', 'bad', 'medium', 'good', 'very good']

In [391]:
df2.sort_values(by='grade')

   id raw_grade      grade
5   6         e   very bad
3   4         c        bad
1   2         b       good
2   3         b       good
0   1         a  very good
4   5         a  very good

# Writing to a csv file

In [392]:
df2.to_csv('temp.csv', mode='a', index=False)  # Append at the end of the file

# Series like ndarray

In [393]:
a = [1, 2, 3, 4, 5, 6, 7, 8]
s = pd.Series(a, index=['a', 'b', 'c', 'd', 'e', 'f','g', 'h'], name='Series')
s.to_numpy()

array([1, 2, 3, 4, 5, 6, 7, 8])

If we want to access the element by key and if the key is not found in series it throws an error so we can use get() function that returns none or specified default if there is no key found.

In [394]:
s.get('w', np.nan)

nan

# Vectorized operations and label alignment with Series

In [395]:
s + s
s * 2
s.iloc[1:] + s.iloc[:-1]
s.name

'Series'

# Column selection, addition, deletion

In [396]:
del data['DoB']

In [397]:
data.pop('Salary')

Sno.
1    15000.0
2    10000.0
3    20000.0
4    15000.0
5        NaN
6        NaN
7    20000.0
8    80000.0
Name: Salary, dtype: float64

Insert column at a specific index by Dataframe.insert()

In [398]:
data.insert(1, 'Department', 'Tech')
data

              Name Department   Age
Sno.
1     Ashish Yadav       Tech  22.0
2             Anil       Tech  23.0
3            Aswan       Tech  21.0
4          Harshit       Tech   NaN
5          Sandeep       Tech  25.0
6             Ajay       Tech  26.0
7          Bhawesh       Tech  23.0
8              NaN       Tech  30.0

Assigning new columns in method chains. assign() always returns a copy of the data, leaving the original DataFrame untouched.

In [399]:
data = data.assign(Salary = 20000)

In [400]:
data1 = pd.DataFrame([[1, 2, 3], [4, 5, 6], [7, 8, 9], [10, 11, 12], [13, 14, 15]], columns=["A", "B", "C"])
data2 = pd.DataFrame([[2, 4], [6, 8], [10, 12]], columns=["A", "B"])
data1 + data2

      A     B   C
0   3.0   6.0 NaN
1  10.0  13.0 NaN
2  17.0  20.0 NaN
3   NaN   NaN NaN
4   NaN   NaN NaN

In [401]:
data1 = pd.DataFrame({'a':[1, 0, 1], 'b':[0, 1, 0]}, dtype=bool)
data2 = pd.DataFrame({'a':[0, 1, 1], 'b':[1, 0, 1]}, dtype=bool)
data1 + data2

      a     b
0  True  True
1  True  True
2  True  True

In [402]:
data1 & data2
data1 | data2
data1 ^ data2

       a     b
0   True  True
1   True  True
2  False  True

# Duplicate Labels
Index objects are not required to be unique; you can have duplicate row or column labels.
# Consequences of Duplicate Labels
Some pandas methods (Series.reindex() for example) just don’t work with duplicates present. The output can’t be determined, and so pandas raises.

Other methods, like indexing, can give very surprising results. Typically indexing with a scalar will reduce dimensionality. Slicing a DataFrame with a scalar will return a Series. Slicing a Series with a scalar will return a scalar. But with duplicates, this isn’t the case.

In [403]:
df3 = pd.DataFrame([[0, 1, 2], [3, 4, 5]], columns=["A", "A", "B"])
df3

   A  A  B
0  0  1  2
1  3  4  5

In [404]:
df3['A'] # returns a Dataframe

   A  A
0  0  1
1  3  4

In [405]:
df4 = pd.DataFrame({"A": [0, 1, 2]}, index=["a", "a", "b"])
df4.loc["a", "A"]  # a Series

a    0
a    1
Name: A, dtype: int64

# Duplicate Label Detection
You can check whether an Index (storing the row or column labels) is unique with Index.is_unique:

In [406]:
print(df4.index.is_unique)
print(df4.columns.is_unique)

False
True

Index.duplicated() will return a boolean ndarray indicating whether a label is repeated.

In [407]:
df4.index.duplicated()

array([False,  True, False])

It can be used as a boolean filter to drop duplicate rows

In [408]:
df4.loc[~df4.index.duplicated(), :]

   A
a  0
b  2

In [409]:
df4.groupby(level=0).mean()

     A
a  0.5
b  2.0

# Disallowing Duplicate Labels
handling duplicates is an important feature when reading in raw data.Both Series and DataFrame disallow duplicate labels by calling .set_flags(allows_duplicate_labels=False). (the default is to allow them). If there are duplicate labels, an exception will be raised.

In [410]:
pd.Series([0, 1, 2], index=["a", "b", "b"]).set_flags(allows_duplicate_labels=False)

DuplicateLabelError: Index has duplicates.
      positions
label
b        [1, 2]

In [ ]:
pd.DataFrame([[0, 1, 2], [3, 4, 5]], columns=["A", "B", "C"],).set_flags(
    allows_duplicate_labels=False
)

   A  B  C
0  0  1  2
1  3  4  5

In [ ]:
df5 = pd.DataFrame({"A": [0, 1, 2, 3]}, index=["x", "y", "X", "Y"]).set_flags(
    allows_duplicate_labels=False
)
df5.flags.allows_duplicate_labels

False